{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 106,
   "metadata": {},
   "outputs": [],
   "source": [
    "# visualization part\n",
    "\n",
    "import jgraph\n",
    "import neo\n",
    "\n",
    "def jgraph_vis(pname):\n",
    "    query = \"\"\"\n",
    "            MATCH (m)-[:HasPrerequisite]->(n) \n",
    "            WHERE (m)-[:UnderProgram]->({name:'\"\"\"+pname+\"\"\"'}) \n",
    "            and (n)-[:UnderProgram]->({name:'\"\"\"+pname+\"\"\"'}) \n",
    "            RETURN m.id, n.id\n",
    "            \"\"\"\n",
    "    adjPair2 = graph.run(query)\n",
    "\n",
    "    adjList = []\n",
    "    for res in adjPair2:\n",
    "        adjList.append(res)\n",
    "    print(\"-----play with 3D Directed Acyclic Graph----\")\n",
    "    jgraph.draw(adjList)\n",
    "\n",
    "\n",
    "def visualize(pname):\n",
    "    query = \"\"\"\n",
    "        MATCH (n:Program{name:'\"\"\"+pname+\"\"\"'})<-[r]-(m)\n",
    "        RETURN n AS source_node,\n",
    "               id(n) AS source_id,\n",
    "               r,\n",
    "               m AS target_node,\n",
    "               id(m) AS target_id\n",
    "        UNION MATCH (p:Program{name:'\"\"\"+pname+\"\"\"'})-[rr]-(n)-[r]-(m:MOOC)\n",
    "        RETURN n AS source_node,\n",
    "               id(n) AS source_id,\n",
    "               r,\n",
    "               m AS target_node,\n",
    "               id(m) AS target_id\n",
    "            \"\"\"\n",
    "    d = graph.run(query)\n",
    "    print(\"       ----------------Complete Subject Graph Under \" + pname + \" Program------------\" )\n",
    "    display(HTML(neo.draw(d,{})))\n",
    "    \n",
    "\n",
    "\n",
    "def visualize_pre_DAG(pname):\n",
    "    query2 = \"\"\"\n",
    "            MATCH (m:Course)-[r]->(n) \n",
    "            WHERE (m)-[:UnderProgram]->({name: '\"\"\"+pname+\"\"\"'}) \n",
    "            and (n)-[:UnderProgram]->({name: '\"\"\"+pname+\"\"\"'}) \n",
    "            RETURN m As source_node, m.id As source_id, r, \n",
    "                   n As target_node, n.id As target_id\n",
    "\n",
    "              \"\"\"\n",
    "\n",
    "    d2 = graph.run(query2)\n",
    "    print(\"      -------------Required Course Enrollment Subgraph Under \" + pname + \" Program------------\" )\n",
    "    display(HTML(neo.draw(d2,{})))\n",
    "\n",
    "# print(\"--------------------DISPLAY KNOWLEDGE GRAPH-------------------------\")\n",
    "# visualize(\"Accounting (BS)\")\n",
    "# pname = \"Accounting (BS)\"\n",
    "# visualize_pre_DAG(pname)\n",
    "# jgraph_vis(pname)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [],
   "source": [
    "## topological listing part\n",
    "\n",
    "import json, jgraph\n",
    "import pandas as pd\n",
    "from py2neo import Graph\n",
    "from collections import defaultdict\n",
    "\n",
    "\n",
    "class Prerequisite:\n",
    "    def __init__(self, courselist):\n",
    "        self.graph = defaultdict(list) \n",
    "        self.vertices = courselist\n",
    " \n",
    "    def addEdge(self, u, v):\n",
    "        self.graph[u].append(v)\n",
    " \n",
    "    def dfs(self, v, visit, order):\n",
    "        visit[v] = True\n",
    "        for u in self.graph[v]:\n",
    "            if visit[u] == False:\n",
    "                self.dfs(u, visit, order)\n",
    "        order.insert(0, v)\n",
    " \n",
    "    def tps(self):\n",
    "        visit = {v: False for v in self.vertices}\n",
    "        order =[]\n",
    "        for v in self.vertices:\n",
    "            if visit[v] == False:\n",
    "                self.dfs(v, visit, order)\n",
    "        return order\n",
    "    \n",
    "    \n",
    "def refernce_display(clist):\n",
    "    content = '''\n",
    "        <table style=\"width:100%\" bordercolor='lightgreen'>\n",
    "          <tr>\n",
    "            <th style=\"text-align:left\"; width=\"10%;\">Code</th>\n",
    "            <th style=\"text-align:left\"; width=\"30%;\">Name</th> \n",
    "            <th style=\"text-align:left\"; width=\"20%;\">Image</th>\n",
    "            <th style=\"text-align:left\"; width=\"40%;\">MOOC</th>\n",
    "          </tr>\n",
    "          '''\n",
    "    for c in clist:\n",
    "        content += '''\n",
    "            <tr>\n",
    "                <td style=\"text-align:left\";>''' + c['code'] + '''</td>\n",
    "                <td style=\"text-align:left\";>''' + c['name'] + '''</td> \n",
    "                <td><img src=''' + c['image'] + ''' height=\"120px\"; display: inline-block;></td>\n",
    "                <td style=\"text-align:left\";> <a href=\"''' + c['url'] + '''\" target=\"_blank\">''' + c['mooc'] + '''</td></tr>'''\n",
    "    #return content\n",
    "    display(HTML(content))\n",
    "    \n",
    "    \n",
    "def display_list(order):\n",
    "    nodes, relat = [], []\n",
    "    course, relation = list(), list()\n",
    "\n",
    "    for id in order:\n",
    "        dic = {}\n",
    "        dic[\"code\"], dic[\"mooc\"], dic[\"url\"], dic[\"image\"] = id, \"\", \"\", \"\"\n",
    "        node = graph.data(\"Match (n:Course{id:'\" + id + \"'}) RETURN n\")\n",
    "        coursename = graph.data(\"Match (n:Course{id:'\" + id + \"'}) RETURN n.name\")[0]\n",
    "        coursedesc = graph.data(\"Match (n:Course{id:'\" + id + \"'}) RETURN n.description\")[0]\n",
    "        mooc = graph.data(\"MATCH p = (n:Course{id:'\"+ id + \"'})-[r:SimilarTo]->(m:MOOC) RETURN m.name limit 1\")\n",
    "        image = graph.data(\"MATCH p = (n:Course{id:'\"+ id + \"'})-[r:SimilarTo]->(m:MOOC) RETURN m.image limit 1\")\n",
    "        url = graph.data(\"MATCH p = (n:Course{id:'\"+ id + \"'})-[r:SimilarTo]->(m:MOOC) RETURN m.url limit 1\")\n",
    "        dic[\"name\"] = coursename[\"n.name\"]\n",
    "        if len(mooc) != 0:\n",
    "            rlist = [id, coursename[\"n.name\"], mooc[0][\"m.name\"], image[0][\"m.image\"], url[0][\"m.url\"]]\n",
    "            relation.append(rlist)\n",
    "            dic[\"mooc\"], dic[\"image\"], dic[\"url\"] = rlist[2], rlist[3], rlist[4]\n",
    "        relat.append(dic)\n",
    "        nodes += node\n",
    "        course.append([id, coursename[\"n.name\"], coursedesc[\"n.description\"]])\n",
    "    course_df = pd.DataFrame(course)\n",
    "    relation_df = pd.DataFrame(relation)\n",
    "    refernce_display(relat)\n",
    "    j = json.dumps(relat)\n",
    "\n",
    "def whole_id(pname):\n",
    "    query2 = \"\"\"\n",
    "            MATCH (m)\n",
    "            WHERE (m)-[:UnderProgram]->({name:'\"\"\"+ pname +\"\"\"'}) \n",
    "            RETURN m.id as id\n",
    "            \"\"\"\n",
    "    data = graph.run(query2)\n",
    "    id_list = []\n",
    "    for id in data:\n",
    "        id_list.append(id[\"id\"])\n",
    "    return id_list\n",
    "\n",
    "\n",
    "def topo_Sort(pname):\n",
    "    graph = Graph(\"http://localhost:7474/db/data/\")\n",
    "    query = \"\"\"\n",
    "            MATCH (m)-[:HasPrerequisite]->(n) \n",
    "            WHERE (m)-[:UnderProgram]->({name:'\"\"\"+ pname +\"\"\"'}) \n",
    "            and (n)-[:UnderProgram]->({name:'\"\"\"+ pname +\"\"\"'}) \n",
    "            RETURN m.id, n.id \n",
    "            \"\"\"\n",
    "    adjPair = graph.data(query)\n",
    "\n",
    "    courselist = []\n",
    "    for i in adjPair:\n",
    "        courselist += [i[\"m.id\"], i[\"n.id\"]]\n",
    "    courselist = list(set(courselist))\n",
    "\n",
    "    g = Prerequisite(courselist)\n",
    "    for edge in adjPair:\n",
    "        g.addEdge(edge[\"m.id\"], edge[\"n.id\"])\n",
    "    toposort = g.tps()\n",
    "    order = toposort[::-1]\n",
    "    display(HTML(\"<h6 style=' font-size: 15px; text-align:center;'>Study Path I: Program-required Enrolling Order with Recommended MOOCs</h6>\"))\n",
    "    display_list(order)\n",
    "\n",
    "    display(HTML(\"<h6 style=' font-size: 15px; text-align:center;'>Study Path II: Self-planned Enrolling Order with Recommended MOOCs</h6>\"))\n",
    "    other = [i for i in whole_id(pname) if i not in order]\n",
    "    display_list(other)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "application/javascript": [
       "$(\"head\").append($(\"<link/>\").attr({\n",
       "  rel:  \"stylesheet\",\n",
       "  type: \"text/css\",\n",
       "  href: \"https://cdnjs.cloudflare.com/ajax/libs/vis/4.8.2/vis.css\"\n",
       "}));\n",
       "require.config({     paths: {         vis: '//cdnjs.cloudflare.com/ajax/libs/vis/4.8.2/vis.min'     } }); require(['vis'], function(vis) {  window.vis = vis; }); "
      ],
      "text/plain": [
       "<IPython.core.display.Javascript object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "b6734bddc19e4056a95b8d330a21f78c",
       "version_major": 2,
       "version_minor": 0
      },
      "text/html": [
       "<p>Failed to display Jupyter Widget of type <code>Text</code>.</p>\n",
       "<p>\n",
       "  If you're reading this message in the Jupyter Notebook or JupyterLab Notebook, it may mean\n",
       "  that the widgets JavaScript is still loading. If this message persists, it\n",
       "  likely means that the widgets JavaScript library is either not installed or\n",
       "  not enabled. See the <a href=\"https://ipywidgets.readthedocs.io/en/stable/user_install.html\">Jupyter\n",
       "  Widgets Documentation</a> for setup instructions.\n",
       "</p>\n",
       "<p>\n",
       "  If you're reading this message in another frontend (for example, a static\n",
       "  rendering on GitHub or <a href=\"https://nbviewer.jupyter.org/\">NBViewer</a>),\n",
       "  it may mean that your frontend doesn't currently support widgets.\n",
       "</p>\n"
      ],
      "text/plain": [
       "Text(value='', description='Search:', placeholder='Program Name')"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "cafd72e040e146c8be411ae5a4a1b188",
       "version_major": 2,
       "version_minor": 0
      },
      "text/html": [
       "<p>Failed to display Jupyter Widget of type <code>Button</code>.</p>\n",
       "<p>\n",
       "  If you're reading this message in the Jupyter Notebook or JupyterLab Notebook, it may mean\n",
       "  that the widgets JavaScript is still loading. If this message persists, it\n",
       "  likely means that the widgets JavaScript library is either not installed or\n",
       "  not enabled. See the <a href=\"https://ipywidgets.readthedocs.io/en/stable/user_install.html\">Jupyter\n",
       "  Widgets Documentation</a> for setup instructions.\n",
       "</p>\n",
       "<p>\n",
       "  If you're reading this message in another frontend (for example, a static\n",
       "  rendering on GitHub or <a href=\"https://nbviewer.jupyter.org/\">NBViewer</a>),\n",
       "  it may mean that your frontend doesn't currently support widgets.\n",
       "</p>\n"
      ],
      "text/plain": [
       "Button(description='See Detail !', style=ButtonStyle())"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Fuzzy Search Part\n",
    "\n",
    "from py2neo import Graph,NodeSelector\n",
    "import neo\n",
    "from ipywidgets import *\n",
    "from IPython.display import display, HTML\n",
    "neo.init_notebook_mode() \n",
    "graph = Graph(\"http://localhost:7474/db/data/\")\n",
    "\n",
    "searchbox = widgets.Text(\n",
    "        placeholder='Program Name',\n",
    "        description='Search:',\n",
    "        disabled=False)\n",
    "    \n",
    "def program_result(plist):\n",
    "    items_layout = Layout(\n",
    "        flex='1 1 auto',\n",
    "        width='auto')     # override the default width of the button to 'auto' to let the button grow\n",
    "\n",
    "    box_layout = Layout(\n",
    "        display='flex',\n",
    "        flex_flow='column',\n",
    "        align_items='stretch',\n",
    "        width='60%')\n",
    "    items = [ToggleButton(description=w, layout=items_layout) for w in plist]\n",
    "    return Box(children=items, layout=box_layout)\n",
    "\n",
    "\n",
    "def search_program(keyword):\n",
    "    query = \"MATCH (p:Program) WHERE p.name =~ '(?i).*\"+keyword+\".*' RETURN p LIMIT 10\"\n",
    "    data = graph.data(query)\n",
    "    return [p['p']['name'] for p in data]\n",
    "\n",
    "def value_changed(change):\n",
    "    res = search_program(change.new)\n",
    "    box = program_result(res)\n",
    "    display(box)\n",
    "    value_changed.box = box.children\n",
    "\n",
    "searchbox.observe(value_changed, 'value')\n",
    "\n",
    "display(searchbox)\n",
    "\n",
    "from IPython.core.display import HTML\n",
    "def on_button_clicked(b):\n",
    "    for box in value_changed.box:\n",
    "        if box.value == True:\n",
    "            selected = box.description\n",
    "            query = \"\"\"\n",
    "                    MATCH (m:Program {name:'\"\"\"+ selected +\"\"\"'}) \n",
    "                    RETURN m.url\n",
    "                    \"\"\"\n",
    "            link = (graph.data(query)[0][\"m.url\"])\n",
    "#             print(link)\n",
    "            visualize(selected)\n",
    "            \n",
    "            display(HTML(\"<div style='color:lightblue; font-size: 14px; text-align:center;'><a href=\" +link+ \"> Visit Program Homepage !</a></div>\"))\n",
    "            visualize_pre_DAG(selected)\n",
    "            topo_Sort(selected)\n",
    "            \n",
    "#   demo_key = [\"da\", \"accounting\"]\n",
    "button = widgets.Button(description=\"See Detail !\")\n",
    "button.on_click(on_button_clicked)\n",
    "display(button)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['BUAD 280', 'BUAD 281', 'ACCT 371', 'ACCT 478', 'ACCT 476', 'ACCT 370', 'ACCT 377', 'ACCT 471', 'ACCT 475', 'MATH 125', 'BUAD 302', 'ACCT 372', 'MATH 118', 'ECON 351', 'BUAD 306', 'ACCT 374', 'ACCT 373', 'ACCT 473', 'ACCT 463', 'ACCT 472', 'BUAD 304', 'BUAD 307', 'BUAD 497', 'ACCT 462', 'ACCT 470', 'ACCT 477', 'ACCT 416', 'ACCT 474', 'ACCT 430', 'ACCT 479']\n",
      "[{'m.name': 'Accounting: Principles of Financial Accounting'}]\n",
      "[{'m.name': 'Managerial Accounting: Cost Behaviors, Systems, and Analysis'}]\n",
      "[{'m.name': 'Accounting and Finance for IT professionals'}]\n",
      "[{'m.name': 'More Introduction to Financial Accounting'}]\n",
      "[{'m.name': 'Measurement and data '}]\n",
      "[]\n",
      "[]\n",
      "[{'m.name': 'Accounting Analytics'}]\n",
      "[{'m.name': 'Cyber-Physical Systems Security'}]\n",
      "[{'m.name': 'Single Variable Calculus'}]\n",
      "[]\n",
      "[]\n",
      "[]\n",
      "[{'m.name': 'Strategic Business Management - Microeconomics'}]\n",
      "[{'m.name': 'Business English: Finance and Economics'}]\n",
      "[]\n",
      "[]\n",
      "[]\n",
      "[]\n",
      "[{'m.name': 'Managerial Accounting: Cost Behaviors, Systems, and Analysis'}]\n",
      "[{'m.name': 'International Leadership and Organizational Behavior'}]\n",
      "[{'m.name': 'Digital Marketing Fundamentals'}]\n",
      "[{'m.name': 'Strategic Business Management - Macroeconomics'}]\n",
      "[]\n",
      "[]\n",
      "[]\n",
      "[{'m.name': 'More Introduction to Financial Accounting'}]\n",
      "[]\n",
      "[{'m.name': 'Accounting Analytics'}]\n",
      "[{'m.name': 'Accounting Analytics'}]\n"
     ]
    },
    {
     "ename": "NameError",
     "evalue": "name 'refernce_display' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-10-cfcf27c935e8>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m    227\u001b[0m   'url': 'http://www.coursera.org/specializations/business-analytics'}]\n\u001b[1;32m    228\u001b[0m \u001b[0mcourse_df\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 229\u001b[0;31m \u001b[0mrefernce_display\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrelat\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m: name 'refernce_display' is not defined"
     ]
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "from collections import defaultdict\n",
    "\n",
    "graph = Graph(\"http://localhost:7474/db/data/\")\n",
    "adjPair = graph.data(\"MATCH (m)-[:HasPrerequisite]->(n) \\\n",
    "        WHERE (m)-[:UnderProgram]->({name: 'Accounting (BS)'}) \\\n",
    "        and (n)-[:UnderProgram]->({name: 'Accounting (BS)'}) \\\n",
    "        RETURN m.id, n.id\")\n",
    "\n",
    "class Prerequisite:\n",
    "    def __init__(self, courselist):\n",
    "        self.graph = defaultdict(list) \n",
    "        self.vertices = courselist\n",
    " \n",
    "    def addEdge(self, u, v):\n",
    "        self.graph[u].append(v)\n",
    " \n",
    "    def dfs(self, v, visit, order):\n",
    "        visit[v] = True\n",
    "        for u in self.graph[v]:\n",
    "            if visit[u] == False:\n",
    "                self.dfs(u, visit, order)\n",
    "        order.insert(0, v)\n",
    " \n",
    "    def tps(self):\n",
    "        visit = {v: False for v in self.vertices}\n",
    "        order =[]\n",
    "        for v in self.vertices:\n",
    "            if visit[v] == False:\n",
    "                self.dfs(v, visit, order)\n",
    "        return order\n",
    "courselist = []\n",
    "for i in adjPair:\n",
    "    courselist += [i[\"m.id\"], i[\"n.id\"]]\n",
    "courselist = list(set(courselist))\n",
    "\n",
    "g = Prerequisite(courselist)\n",
    "for edge in adjPair:\n",
    "    g.addEdge(edge[\"m.id\"], edge[\"n.id\"])\n",
    "# MATCH (n:Course{id:\"BUAD 280\"}) RETURN n\n",
    "\n",
    "toposort = g.tps()\n",
    "print(toposort[::-1])\n",
    "nodes = []\n",
    "course = list()\n",
    "relation = list()\n",
    "relat = []\n",
    "import pandas as pd\n",
    "for id in toposort[::-1]:\n",
    "    dic = {}\n",
    "    node = graph.data(\"Match (n:Course{id:'\" + id + \"'}) RETURN n\")\n",
    "    coursename = graph.data(\"Match (n:Course{id:'\" + id + \"'}) RETURN n.name\")[0]\n",
    "    coursedesc = graph.data(\"Match (n:Course{id:'\" + id + \"'}) RETURN n.description\")[0]\n",
    "    mooc = graph.data(\"MATCH p = (n:Course{id:'\"+ id + \"'})-[r:SimilarTo]->(m:MOOC) RETURN m.name limit 1\")\n",
    "    image = graph.data(\"MATCH p = (n:Course{id:'\"+ id + \"'})-[r:SimilarTo]->(m:MOOC) RETURN m.image limit 1\")\n",
    "    url = graph.data(\"MATCH p = (n:Course{id:'\"+ id + \"'})-[r:SimilarTo]->(m:MOOC) RETURN m.url limit 1\")\n",
    "    print(mooc)\n",
    "    dic[\"code\"] = id\n",
    "    dic[\"name\"] = coursename[\"n.name\"]\n",
    "    dic[\"mooc\"] = \"\"\n",
    "    dic[\"url\"] = \"\"\n",
    "    dic[\"image\"] = \"\"\n",
    "    if len(mooc) != 0:\n",
    "        rlist = [id, coursename[\"n.name\"], mooc[0][\"m.name\"], image[0][\"m.image\"], url[0][\"m.url\"]]\n",
    "        relation.append(rlist)\n",
    "        dic[\"mooc\"], dic[\"image\"], dic[\"url\"] = rlist[2], rlist[3], rlist[4]\n",
    "    relat.append(dic)\n",
    "    nodes += node\n",
    "    course.append([id, coursename[\"n.name\"], coursedesc[\"n.description\"]])\n",
    "    \n",
    "course_df = pd.DataFrame(course)\n",
    "relation_df = pd.DataFrame(relation)\n",
    "relat\n",
    "import json\n",
    "j = json.dumps(relat)\n",
    "\n",
    "# nodes\n",
    "# print(nodes)\n",
    "\n",
    "\n",
    "course_list = [{'code': 'BUAD 280',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/f2/fdfaf0f9a511e6a5f4effa0e2c4d64/investigaci_n-de-mercados-y-comportamiento.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Accounting: Principles of Financial Accounting',\n",
    "  'name': 'BUAD 280 Introduction to Financial Accounting',\n",
    "  'url': 'http://www.coursera.org/specializations/foundations-management'},\n",
    " {'code': 'MATH 118',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'MATH 118gx Fundamental Principles of Calculus',\n",
    "  'url': ''},\n",
    " {'code': 'MATH 125',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/05/cda840977511e5aa161903ab17f92e/CSV-logo-chapter-5-copy.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Single Variable Calculus',\n",
    "  'name': 'MATH 125g Calculus I',\n",
    "  'url': 'http://www.coursera.org/learn/discrete-calculus'},\n",
    " {'code': 'ECON 351',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/06/ab77207de611e78b8cbf6b7d2487ac/image-1.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Strategic Business Management - Microeconomics',\n",
    "  'name': 'ECON 351x Microeconomics for Business',\n",
    "  'url': 'http://www.coursera.org/learn/parprog1'},\n",
    " {'code': 'BUAD 306',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/4c/868cb0658911e6892f017139b2b060/coursera-ma-thumbnail.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Business English: Finance and Economics',\n",
    "  'name': 'BUAD 306 Business Finance',\n",
    "  'url': 'http://www.coursera.org/specializations/english-for-business'},\n",
    " {'code': 'BUAD 281',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d396qusza40orc.cloudfront.net/phoenixassets/learn-finance/BNY_Specialization_Banner_logo.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Managerial Accounting: Cost Behaviors, Systems, and Analysis',\n",
    "  'name': 'BUAD 281 Introduction to Managerial Accounting',\n",
    "  'url': 'http://www.coursera.org/specializations/value-chain-management'},\n",
    " {'code': 'ACCT 370',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 370 External Financial Reporting Issues',\n",
    "  'url': ''},\n",
    " {'code': 'ACCT 371',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/dd/7ae3d0bd8411e6834f83bd22b5a2e6/PositivePsychology_MOOC_Icons_Specialization.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Accounting and Finance for IT professionals',\n",
    "  'name': 'ACCT 371 Introduction to Accounting Systems',\n",
    "  'url': 'http://www.coursera.org/specializations/business-technology-managment'},\n",
    " {'code': 'ACCT 373',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 373 Introduction to Auditing and Assurance Services',\n",
    "  'url': ''},\n",
    " {'code': 'ACCT 377',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 377 Valuation for Financial Statement Purposes',\n",
    "  'url': ''},\n",
    " {'code': 'ACCT 416',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/3e/b505c0ee7611e4890b43504b150d21/online_learning_slide_vAccounting.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'More Introduction to Financial Accounting',\n",
    "  'name': 'ACCT 416 Financial Reporting and Analysis',\n",
    "  'url': 'http://www.coursera.org/learn/wharton-financial-accounting'},\n",
    " {'code': 'ACCT 462',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 462 Detecting Fraudulent Financial Reporting',\n",
    "  'url': ''},\n",
    " {'code': 'ACCT 476',\n",
    "  'image': 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTWVTAsQKuMSTnREno6zNLCslVti6JN7G9RHpDFXaikAiF36rquQakV1igF',\n",
    "  'mooc': 'Measurement and data ',\n",
    "  'name': 'ACCT 476 Performance Measurement Issues',\n",
    "  'url': 'https://www.khanacademy.org/math/cc-2nd-grade-math/cc-2nd-measurement-data'},\n",
    " {'code': 'BUAD 302',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'BUAD 302T Communication Strategy in Accounting',\n",
    "  'url': ''},\n",
    " {'code': 'BUAD 307',\n",
    "  'image': 'https://s3-us-west-1.amazonaws.com/udacity-content/course-images/cx11-e152d95.jpg',\n",
    "  'mooc': 'Digital Marketing Fundamentals',\n",
    "  'name': 'BUAD 307 Marketing Fundamentals',\n",
    "  'url': 'https://www.udacity.com/course/digital-marketing-fundamentals--cx11'},\n",
    " {'code': 'ACCT 477',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 477 Intermediate Fair Value Issues in Accounting',\n",
    "  'url': ''},\n",
    " {'code': 'ACCT 478',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/3e/b505c0ee7611e4890b43504b150d21/online_learning_slide_vAccounting.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'More Introduction to Financial Accounting',\n",
    "  'name': 'ACCT 478 Accounting Systems Design',\n",
    "  'url': 'http://www.coursera.org/learn/wharton-financial-accounting'},\n",
    " {'code': 'ACCT 473',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 473 Financial Statement Auditing',\n",
    "  'url': ''},\n",
    " {'code': 'ACCT 475',\n",
    "  'image': 'https://lh3.googleusercontent.com/pjV2kaEQlQuzZSTR8YwIYyDieRxdfH6i0QfGzSCI1iTawtnhYJmbn2RC0rXdsnSGf6FaoIuLHE11NyFL=s0#w=1280&h=720=s276#w=1724&h=1060',\n",
    "  'mooc': 'Cyber-Physical Systems Security',\n",
    "  'name': 'ACCT 475 Systems Security and Audit',\n",
    "  'url': 'https://www.udacity.com/course/cyber-physical-systems-security--ud279'},\n",
    " {'code': 'ACCT 463',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 463 Internal Audit',\n",
    "  'url': ''},\n",
    " {'code': 'BUAD 304',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/62/58d990f18cd48083251c3e57fe9e7e/Untitled-1.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'International Leadership and Organizational Behavior',\n",
    "  'name': 'BUAD 304 Organizational Behavior and Leadership',\n",
    "  'url': 'http://www.coursera.org/learn/academic-discussion-english'},\n",
    " {'code': 'BUAD 497',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/d3/d90f107de511e7b945f75a7283d500/image-2.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Strategic Business Management - Macroeconomics',\n",
    "  'name': 'BUAD 497 Strategic Management',\n",
    "  'url': 'http://www.coursera.org/learn/trigonometry'},\n",
    " {'code': 'ACCT 479',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ef/485800fcfd11e6b4cc3359e41f40e9/Pricing-Strategy.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Accounting Analytics',\n",
    "  'name': 'ACCT 479 Accounting Systems Development',\n",
    "  'url': 'http://www.coursera.org/specializations/business-analytics'},\n",
    " {'code': 'ACCT 374',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 374 Introduction to Tax Issues',\n",
    "  'url': ''},\n",
    " {'code': 'ACCT 474',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 474 Tax Issues for Business',\n",
    "  'url': ''},\n",
    " {'code': 'ACCT 470',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 470 Advanced External Financial Reporting Issues',\n",
    "  'url': ''},\n",
    " {'code': 'ACCT 471',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/e7/871c10757e11e7817cc9840feed7fa/enigma_rotors_with_alphabet_rings_cropped.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Accounting Analytics',\n",
    "  'name': 'ACCT 471 Accounting Information Systems',\n",
    "  'url': 'http://www.coursera.org/specializations/business-analytics'},\n",
    " {'code': 'ACCT 372',\n",
    "  'image': '',\n",
    "  'mooc': '',\n",
    "  'name': 'ACCT 372 Internal Reporting Issues',\n",
    "  'url': ''},\n",
    " {'code': 'ACCT 472',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d396qusza40orc.cloudfront.net/phoenixassets/learn-finance/BNY_Specialization_Banner_logo.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Managerial Accounting: Cost Behaviors, Systems, and Analysis',\n",
    "  'name': 'ACCT 472 Managerial Accounting',\n",
    "  'url': 'http://www.coursera.org/specializations/value-chain-management'},\n",
    " {'code': 'ACCT 430',\n",
    "  'image': 'https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ef/485800fcfd11e6b4cc3359e41f40e9/Pricing-Strategy.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF',\n",
    "  'mooc': 'Accounting Analytics',\n",
    "  'name': 'ACCT 430 Accounting Ethics',\n",
    "  'url': 'http://www.coursera.org/specializations/business-analytics'}]\n",
    "course_df\n",
    "refernce_display(relat)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'refernce_display' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-11-26926face5f3>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mrefernce_display\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcourse_list\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m: name 'refernce_display' is not defined"
     ]
    }
   ],
   "source": [
    "refernce_display(course_list)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['BUAD 280', 'BUAD 281', 'BUAD 302', 'BUAD 304', 'BUAD 306', 'BUAD 307', 'BUAD 310', 'BUAD 311', 'BUAD 497', 'ECON 351', 'ECON 352', 'MATH 118', 'MATH 125', 'ACCT 370', 'ACCT 371', 'ACCT 372', 'ACCT 373', 'ACCT 374', 'ACCT 377', 'ACCT 430', 'ACCT 470', 'ACCT 473', 'ACCT 474', 'ACCT 416', 'ACCT 462', 'ACCT 463', 'ACCT 471', 'ACCT 472', 'ACCT 475', 'ACCT 476', 'ACCT 477', 'ACCT 478', 'ACCT 479', 'ACCT 493']\n"
     ]
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "def visualize(pname):\n",
    "    query = \"\"\"\n",
    "        MATCH (n:Program{name:'\"\"\"+pname+\"\"\"'})<-[r]-(m)\n",
    "        RETURN n AS source_node,\n",
    "               id(n) AS source_id,\n",
    "               r,\n",
    "               m AS target_node,\n",
    "               id(m) AS target_id\n",
    "        UNION MATCH (p:Program{name:'\"\"\"+pname+\"\"\"'})-[rr]-(n)-[r]-(m:MOOC)\n",
    "        RETURN n AS source_node,\n",
    "               id(n) AS source_id,\n",
    "               r,\n",
    "               m AS target_node,\n",
    "               id(m) AS target_id\n",
    "            \"\"\"\n",
    "    d = graph.run(query)\n",
    "    display(HTML(neo.draw(d,{})))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "def search_program(keyword):\n",
    "    query = \"MATCH (p:Program) WHERE p.name =~ '(?i).*\"+keyword+\".*' RETURN p LIMIT 10\"\n",
    "    data = graph.data(query)\n",
    "    return [p['p']['name'] for p in data]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "# visualization part\n",
    "\n",
    "import jgraph\n",
    "import neo\n",
    "\n",
    "def jgraph_vis(pname):\n",
    "    query = \"\"\"\n",
    "            MATCH (m)-[:HasPrerequisite]->(n) \\\n",
    "            WHERE (m)-[:UnderProgram]->({name:'\"\"\"+pname+\"\"\"'}) \\\n",
    "            and (n)-[:UnderProgram]->({name:'\"\"\"+pname+\"\"\"'}) \\\n",
    "            RETURN m.id, n.id\n",
    "            \"\"\"\n",
    "    adjPair2 = graph.run(query)\n",
    "\n",
    "    adjList = []\n",
    "    for res in adjPair2:\n",
    "        adjList.append(res)\n",
    "    print(\"-----play with 3D Directed Acyclic Graph----\")\n",
    "    jgraph.draw(adjList)\n",
    "\n",
    "\n",
    "def visualize(pname):\n",
    "    query = \"\"\"\n",
    "        MATCH (n:Program{name:'\"\"\"+pname+\"\"\"'})<-[r]-(m)\n",
    "        RETURN n AS source_node,\n",
    "               id(n) AS source_id,\n",
    "               r,\n",
    "               m AS target_node,\n",
    "               id(m) AS target_id\n",
    "        UNION MATCH (p:Program{name:'\"\"\"+pname+\"\"\"'})-[rr]-(n)-[r]-(m:MOOC)\n",
    "        RETURN n AS source_node,\n",
    "               id(n) AS source_id,\n",
    "               r,\n",
    "               m AS target_node,\n",
    "               id(m) AS target_id\n",
    "            \"\"\"\n",
    "    d = graph.run(query)\n",
    "    print(\"----------------Subject Graph Under \" + pname + \"------------\" )\n",
    "    display(HTML(neo.draw(d,{})))\n",
    "    \n",
    "\n",
    "\n",
    "def visualize_pre_DAG(pname):\n",
    "    query2 = \"\"\"\n",
    "            MATCH (m:Course)-[r]->(n) \\\n",
    "            WHERE (m)-[:UnderProgram]->({name: '\"\"\"+pname+\"\"\"'}) \\\n",
    "            and (n)-[:UnderProgram]->({name: '\"\"\"+pname+\"\"\"'}) \\\n",
    "            RETURN m As source_node, m.id As source_id, r, \n",
    "                   n As target_node, n.id As target_id\n",
    "\n",
    "              \"\"\"\n",
    "\n",
    "    d2 = graph.run(query2)\n",
    "    print(\"-------------Course Enrollment Graph Under \" + pname + \"------------\\n\\n\" )\n",
    "    display(HTML(neo.draw(d2,{})))\n",
    "\n",
    "# print(\"--------------------DISPLAY KNOWLEDGE GRAPH-------------------------\")\n",
    "# visualize(\"Accounting (BS)\")\n",
    "pname = \"Accounting (BS)\"\n",
    "# visualize_pre_DAG(pname)\n",
    "# jgraph_vis(pname)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "    ----------Study Path: School Course with Recommended MOOC----------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <table style=\"width:100%\" bordercolor='lightgreen'>\n",
       "          <tr>\n",
       "            <th style=\"text-align:left\"; width=\"10%;\">Code</th>\n",
       "            <th style=\"text-align:left\"; width=\"30%;\">Name</th> \n",
       "            <th style=\"text-align:left\"; width=\"20%;\">Image</th>\n",
       "            <th style=\"text-align:left\"; width=\"40%;\">MOOC</th>\n",
       "          </tr>\n",
       "          \n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 280</td>\n",
       "                <td style=\"text-align:left\";>BUAD 280 Introduction to Financial Accounting</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/f2/fdfaf0f9a511e6a5f4effa0e2c4d64/investigaci_n-de-mercados-y-comportamiento.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/foundations-management\" target=\"_blank\">Accounting: Principles of Financial Accounting</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 281</td>\n",
       "                <td style=\"text-align:left\";>BUAD 281 Introduction to Managerial Accounting</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d396qusza40orc.cloudfront.net/phoenixassets/learn-finance/BNY_Specialization_Banner_logo.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/value-chain-management\" target=\"_blank\">Managerial Accounting: Cost Behaviors, Systems, and Analysis</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 371</td>\n",
       "                <td style=\"text-align:left\";>ACCT 371 Introduction to Accounting Systems</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/dd/7ae3d0bd8411e6834f83bd22b5a2e6/PositivePsychology_MOOC_Icons_Specialization.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/business-technology-managment\" target=\"_blank\">Accounting and Finance for IT professionals</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 478</td>\n",
       "                <td style=\"text-align:left\";>ACCT 478 Accounting Systems Design</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/3e/b505c0ee7611e4890b43504b150d21/online_learning_slide_vAccounting.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/wharton-financial-accounting\" target=\"_blank\">More Introduction to Financial Accounting</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 476</td>\n",
       "                <td style=\"text-align:left\";>ACCT 476 Performance Measurement Issues</td> \n",
       "                <td><img src=https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTWVTAsQKuMSTnREno6zNLCslVti6JN7G9RHpDFXaikAiF36rquQakV1igF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"https://www.khanacademy.org/math/cc-2nd-grade-math/cc-2nd-measurement-data\" target=\"_blank\">Measurement and data </td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 302</td>\n",
       "                <td style=\"text-align:left\";>BUAD 302T Communication Strategy in Accounting</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 304</td>\n",
       "                <td style=\"text-align:left\";>BUAD 304 Organizational Behavior and Leadership</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/62/58d990f18cd48083251c3e57fe9e7e/Untitled-1.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/academic-discussion-english\" target=\"_blank\">International Leadership and Organizational Behavior</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>MATH 118</td>\n",
       "                <td style=\"text-align:left\";>MATH 118gx Fundamental Principles of Calculus</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>MATH 125</td>\n",
       "                <td style=\"text-align:left\";>MATH 125g Calculus I</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/05/cda840977511e5aa161903ab17f92e/CSV-logo-chapter-5-copy.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/discrete-calculus\" target=\"_blank\">Single Variable Calculus</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ECON 351</td>\n",
       "                <td style=\"text-align:left\";>ECON 351x Microeconomics for Business</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/06/ab77207de611e78b8cbf6b7d2487ac/image-1.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/parprog1\" target=\"_blank\">Strategic Business Management - Microeconomics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 306</td>\n",
       "                <td style=\"text-align:left\";>BUAD 306 Business Finance</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/4c/868cb0658911e6892f017139b2b060/coursera-ma-thumbnail.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/english-for-business\" target=\"_blank\">Business English: Finance and Economics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 307</td>\n",
       "                <td style=\"text-align:left\";>BUAD 307 Marketing Fundamentals</td> \n",
       "                <td><img src=https://s3-us-west-1.amazonaws.com/udacity-content/course-images/cx11-e152d95.jpg height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"https://www.udacity.com/course/digital-marketing-fundamentals--cx11\" target=\"_blank\">Digital Marketing Fundamentals</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 497</td>\n",
       "                <td style=\"text-align:left\";>BUAD 497 Strategic Management</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/d3/d90f107de511e7b945f75a7283d500/image-2.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/trigonometry\" target=\"_blank\">Strategic Business Management - Macroeconomics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 372</td>\n",
       "                <td style=\"text-align:left\";>ACCT 372 Internal Reporting Issues</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 370</td>\n",
       "                <td style=\"text-align:left\";>ACCT 370 External Financial Reporting Issues</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 373</td>\n",
       "                <td style=\"text-align:left\";>ACCT 373 Introduction to Auditing and Assurance Services</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 374</td>\n",
       "                <td style=\"text-align:left\";>ACCT 374 Introduction to Tax Issues</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 377</td>\n",
       "                <td style=\"text-align:left\";>ACCT 377 Valuation for Financial Statement Purposes</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 430</td>\n",
       "                <td style=\"text-align:left\";>ACCT 430 Accounting Ethics</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ef/485800fcfd11e6b4cc3359e41f40e9/Pricing-Strategy.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/business-analytics\" target=\"_blank\">Accounting Analytics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 477</td>\n",
       "                <td style=\"text-align:left\";>ACCT 477 Intermediate Fair Value Issues in Accounting</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 462</td>\n",
       "                <td style=\"text-align:left\";>ACCT 462 Detecting Fraudulent Financial Reporting</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 475</td>\n",
       "                <td style=\"text-align:left\";>ACCT 475 Systems Security and Audit</td> \n",
       "                <td><img src=https://lh3.googleusercontent.com/pjV2kaEQlQuzZSTR8YwIYyDieRxdfH6i0QfGzSCI1iTawtnhYJmbn2RC0rXdsnSGf6FaoIuLHE11NyFL=s0#w=1280&h=720=s276#w=1724&h=1060 height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"https://www.udacity.com/course/cyber-physical-systems-security--ud279\" target=\"_blank\">Cyber-Physical Systems Security</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 470</td>\n",
       "                <td style=\"text-align:left\";>ACCT 470 Advanced External Financial Reporting Issues</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 474</td>\n",
       "                <td style=\"text-align:left\";>ACCT 474 Tax Issues for Business</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 416</td>\n",
       "                <td style=\"text-align:left\";>ACCT 416 Financial Reporting and Analysis</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/3e/b505c0ee7611e4890b43504b150d21/online_learning_slide_vAccounting.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/wharton-financial-accounting\" target=\"_blank\">More Introduction to Financial Accounting</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 479</td>\n",
       "                <td style=\"text-align:left\";>ACCT 479 Accounting Systems Development</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ef/485800fcfd11e6b4cc3359e41f40e9/Pricing-Strategy.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/business-analytics\" target=\"_blank\">Accounting Analytics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 473</td>\n",
       "                <td style=\"text-align:left\";>ACCT 473 Financial Statement Auditing</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 471</td>\n",
       "                <td style=\"text-align:left\";>ACCT 471 Accounting Information Systems</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/e7/871c10757e11e7817cc9840feed7fa/enigma_rotors_with_alphabet_rings_cropped.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/business-analytics\" target=\"_blank\">Accounting Analytics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 472</td>\n",
       "                <td style=\"text-align:left\";>ACCT 472 Managerial Accounting</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d396qusza40orc.cloudfront.net/phoenixassets/learn-finance/BNY_Specialization_Banner_logo.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/value-chain-management\" target=\"_blank\">Managerial Accounting: Cost Behaviors, Systems, and Analysis</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 463</td>\n",
       "                <td style=\"text-align:left\";>ACCT 463 Internal Audit</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "       ----------Course Enrollment Table----------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>BUAD 280</td>\n",
       "      <td>BUAD 280 Introduction to Financial Accounting</td>\n",
       "      <td>Emphasis on understanding financial statements...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>BUAD 281</td>\n",
       "      <td>BUAD 281 Introduction to Managerial Accounting</td>\n",
       "      <td>An emphasis on how accounting information , co...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ACCT 371</td>\n",
       "      <td>ACCT 371 Introduction to Accounting Systems</td>\n",
       "      <td>Understanding of technology and controls neede...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ACCT 478</td>\n",
       "      <td>ACCT 478 Accounting Systems Design</td>\n",
       "      <td>Explores the design of accounting systems . In...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ACCT 476</td>\n",
       "      <td>ACCT 476 Performance Measurement Issues</td>\n",
       "      <td>Introduction to understanding how management c...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>BUAD 302</td>\n",
       "      <td>BUAD 302T Communication Strategy in Accounting</td>\n",
       "      <td>Theory , practices , and techniques essential ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>BUAD 304</td>\n",
       "      <td>BUAD 304 Organizational Behavior and Leadership</td>\n",
       "      <td>The role of leadership in business organizatio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>MATH 118</td>\n",
       "      <td>MATH 118gx Fundamental Principles of Calculus</td>\n",
       "      <td>Derivatives ; extrema . Definite integral ; fu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>MATH 125</td>\n",
       "      <td>MATH 125g Calculus I</td>\n",
       "      <td>Limits ; continuity , derivatives and applicat...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ECON 351</td>\n",
       "      <td>ECON 351x Microeconomics for Business</td>\n",
       "      <td>Development and business applications of : the...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>BUAD 306</td>\n",
       "      <td>BUAD 306 Business Finance</td>\n",
       "      <td>Financial problems of business enterprise ; fu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>BUAD 307</td>\n",
       "      <td>BUAD 307 Marketing Fundamentals</td>\n",
       "      <td>Develops a managerial viewpoint in planning an...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>BUAD 497</td>\n",
       "      <td>BUAD 497 Strategic Management</td>\n",
       "      <td>Examination of managerial decision-making , pl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ACCT 372</td>\n",
       "      <td>ACCT 372 Internal Reporting Issues</td>\n",
       "      <td>Understanding of decision-making , problem sol...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ACCT 370</td>\n",
       "      <td>ACCT 370 External Financial Reporting Issues</td>\n",
       "      <td>Understanding of decision-making , problem sol...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>ACCT 373</td>\n",
       "      <td>ACCT 373 Introduction to Auditing and Assuranc...</td>\n",
       "      <td>Exploration of the requisite skills and knowle...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ACCT 374</td>\n",
       "      <td>ACCT 374 Introduction to Tax Issues</td>\n",
       "      <td>Basic tax principles , introduction to U .S . ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>ACCT 377</td>\n",
       "      <td>ACCT 377 Valuation for Financial Statement Pur...</td>\n",
       "      <td>Explores Accounting Standards Codification (AS...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>ACCT 430</td>\n",
       "      <td>ACCT 430 Accounting Ethics</td>\n",
       "      <td>Theoretical knowledge and practical applicatio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>ACCT 477</td>\n",
       "      <td>ACCT 477 Intermediate Fair Value Issues in Acc...</td>\n",
       "      <td>Develops the ability to identify and understan...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>ACCT 462</td>\n",
       "      <td>ACCT 462 Detecting Fraudulent Financial Reporting</td>\n",
       "      <td>Understanding/identifying methods of fraudulen...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ACCT 475</td>\n",
       "      <td>ACCT 475 Systems Security and Audit</td>\n",
       "      <td>Issues related to the security , control , and...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>ACCT 470</td>\n",
       "      <td>ACCT 470 Advanced External Financial Reporting...</td>\n",
       "      <td>Develop capabilities to identify and resolve a...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>ACCT 474</td>\n",
       "      <td>ACCT 474 Tax Issues for Business</td>\n",
       "      <td>Capabilities to identify and articulate tax is...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>ACCT 416</td>\n",
       "      <td>ACCT 416 Financial Reporting and Analysis</td>\n",
       "      <td>Examination of the role of financial statement...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>ACCT 479</td>\n",
       "      <td>ACCT 479 Accounting Systems Development</td>\n",
       "      <td>Examines the fundamentals of accounting system...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>ACCT 473</td>\n",
       "      <td>ACCT 473 Financial Statement Auditing</td>\n",
       "      <td>Course builds on the background developed in A...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>ACCT 471</td>\n",
       "      <td>ACCT 471 Accounting Information Systems</td>\n",
       "      <td>Issues related to the design , control , and i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>ACCT 472</td>\n",
       "      <td>ACCT 472 Managerial Accounting</td>\n",
       "      <td>Understanding of systems providing cost inform...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>ACCT 463</td>\n",
       "      <td>ACCT 463 Internal Audit</td>\n",
       "      <td>Examination of internal audit/auditors and the...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           0                                                  1  \\\n",
       "0   BUAD 280      BUAD 280 Introduction to Financial Accounting   \n",
       "1   BUAD 281     BUAD 281 Introduction to Managerial Accounting   \n",
       "2   ACCT 371        ACCT 371 Introduction to Accounting Systems   \n",
       "3   ACCT 478                 ACCT 478 Accounting Systems Design   \n",
       "4   ACCT 476            ACCT 476 Performance Measurement Issues   \n",
       "5   BUAD 302     BUAD 302T Communication Strategy in Accounting   \n",
       "6   BUAD 304    BUAD 304 Organizational Behavior and Leadership   \n",
       "7   MATH 118      MATH 118gx Fundamental Principles of Calculus   \n",
       "8   MATH 125                               MATH 125g Calculus I   \n",
       "9   ECON 351              ECON 351x Microeconomics for Business   \n",
       "10  BUAD 306                          BUAD 306 Business Finance   \n",
       "11  BUAD 307                    BUAD 307 Marketing Fundamentals   \n",
       "12  BUAD 497                      BUAD 497 Strategic Management   \n",
       "13  ACCT 372                 ACCT 372 Internal Reporting Issues   \n",
       "14  ACCT 370       ACCT 370 External Financial Reporting Issues   \n",
       "15  ACCT 373  ACCT 373 Introduction to Auditing and Assuranc...   \n",
       "16  ACCT 374                ACCT 374 Introduction to Tax Issues   \n",
       "17  ACCT 377  ACCT 377 Valuation for Financial Statement Pur...   \n",
       "18  ACCT 430                         ACCT 430 Accounting Ethics   \n",
       "19  ACCT 477  ACCT 477 Intermediate Fair Value Issues in Acc...   \n",
       "20  ACCT 462  ACCT 462 Detecting Fraudulent Financial Reporting   \n",
       "21  ACCT 475                ACCT 475 Systems Security and Audit   \n",
       "22  ACCT 470  ACCT 470 Advanced External Financial Reporting...   \n",
       "23  ACCT 474                   ACCT 474 Tax Issues for Business   \n",
       "24  ACCT 416          ACCT 416 Financial Reporting and Analysis   \n",
       "25  ACCT 479            ACCT 479 Accounting Systems Development   \n",
       "26  ACCT 473              ACCT 473 Financial Statement Auditing   \n",
       "27  ACCT 471            ACCT 471 Accounting Information Systems   \n",
       "28  ACCT 472                     ACCT 472 Managerial Accounting   \n",
       "29  ACCT 463                            ACCT 463 Internal Audit   \n",
       "\n",
       "                                                    2  \n",
       "0   Emphasis on understanding financial statements...  \n",
       "1   An emphasis on how accounting information , co...  \n",
       "2   Understanding of technology and controls neede...  \n",
       "3   Explores the design of accounting systems . In...  \n",
       "4   Introduction to understanding how management c...  \n",
       "5   Theory , practices , and techniques essential ...  \n",
       "6   The role of leadership in business organizatio...  \n",
       "7   Derivatives ; extrema . Definite integral ; fu...  \n",
       "8   Limits ; continuity , derivatives and applicat...  \n",
       "9   Development and business applications of : the...  \n",
       "10  Financial problems of business enterprise ; fu...  \n",
       "11  Develops a managerial viewpoint in planning an...  \n",
       "12  Examination of managerial decision-making , pl...  \n",
       "13  Understanding of decision-making , problem sol...  \n",
       "14  Understanding of decision-making , problem sol...  \n",
       "15  Exploration of the requisite skills and knowle...  \n",
       "16  Basic tax principles , introduction to U .S . ...  \n",
       "17  Explores Accounting Standards Codification (AS...  \n",
       "18  Theoretical knowledge and practical applicatio...  \n",
       "19  Develops the ability to identify and understan...  \n",
       "20  Understanding/identifying methods of fraudulen...  \n",
       "21  Issues related to the security , control , and...  \n",
       "22  Develop capabilities to identify and resolve a...  \n",
       "23  Capabilities to identify and articulate tax is...  \n",
       "24  Examination of the role of financial statement...  \n",
       "25  Examines the fundamentals of accounting system...  \n",
       "26  Course builds on the background developed in A...  \n",
       "27  Issues related to the design , control , and i...  \n",
       "28  Understanding of systems providing cost inform...  \n",
       "29  Examination of internal audit/auditors and the...  "
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import json, jgraph\n",
    "import pandas as pd\n",
    "from py2neo import Graph\n",
    "from collections import defaultdict\n",
    "\n",
    "\n",
    "class Prerequisite:\n",
    "    def __init__(self, courselist):\n",
    "        self.graph = defaultdict(list) \n",
    "        self.vertices = courselist\n",
    " \n",
    "    def addEdge(self, u, v):\n",
    "        self.graph[u].append(v)\n",
    " \n",
    "    def dfs(self, v, visit, order):\n",
    "        visit[v] = True\n",
    "        for u in self.graph[v]:\n",
    "            if visit[u] == False:\n",
    "                self.dfs(u, visit, order)\n",
    "        order.insert(0, v)\n",
    " \n",
    "    def tps(self):\n",
    "        visit = {v: False for v in self.vertices}\n",
    "        order =[]\n",
    "        for v in self.vertices:\n",
    "            if visit[v] == False:\n",
    "                self.dfs(v, visit, order)\n",
    "        return order\n",
    "    \n",
    "    \n",
    "def refernce_display(clist):\n",
    "    content = '''\n",
    "        <table style=\"width:100%\" bordercolor='lightgreen'>\n",
    "          <tr>\n",
    "            <th style=\"text-align:left\"; width=\"10%;\">Code</th>\n",
    "            <th style=\"text-align:left\"; width=\"30%;\">Name</th> \n",
    "            <th style=\"text-align:left\"; width=\"20%;\">Image</th>\n",
    "            <th style=\"text-align:left\"; width=\"40%;\">MOOC</th>\n",
    "          </tr>\n",
    "          '''\n",
    "    for c in clist:\n",
    "        content += '''\n",
    "            <tr>\n",
    "                <td style=\"text-align:left\";>''' + c['code'] + '''</td>\n",
    "                <td style=\"text-align:left\";>''' + c['name'] + '''</td> \n",
    "                <td><img src=''' + c['image'] + ''' height=\"120px\"; display: inline-block;></td>\n",
    "                <td style=\"text-align:left\";> <a href=\"''' + c['url'] + '''\" target=\"_blank\">''' + c['mooc'] + '''</td></tr>'''\n",
    "    #return content\n",
    "    display(HTML(content))\n",
    "    \n",
    "    \n",
    "def display_list(order):\n",
    "    nodes, relat = [], []\n",
    "    course, relation = list(), list()\n",
    "\n",
    "    for id in order:\n",
    "        dic = {}\n",
    "        dic[\"code\"], dic[\"mooc\"], dic[\"url\"], dic[\"image\"] = id, \"\", \"\", \"\"\n",
    "        node = graph.data(\"Match (n:Course{id:'\" + id + \"'}) RETURN n\")\n",
    "        coursename = graph.data(\"Match (n:Course{id:'\" + id + \"'}) RETURN n.name\")[0]\n",
    "        coursedesc = graph.data(\"Match (n:Course{id:'\" + id + \"'}) RETURN n.description\")[0]\n",
    "        mooc = graph.data(\"MATCH p = (n:Course{id:'\"+ id + \"'})-[r:SimilarTo]->(m:MOOC) RETURN m.name limit 1\")\n",
    "        image = graph.data(\"MATCH p = (n:Course{id:'\"+ id + \"'})-[r:SimilarTo]->(m:MOOC) RETURN m.image limit 1\")\n",
    "        url = graph.data(\"MATCH p = (n:Course{id:'\"+ id + \"'})-[r:SimilarTo]->(m:MOOC) RETURN m.url limit 1\")\n",
    "        dic[\"name\"] = coursename[\"n.name\"]\n",
    "        if len(mooc) != 0:\n",
    "            rlist = [id, coursename[\"n.name\"], mooc[0][\"m.name\"], image[0][\"m.image\"], url[0][\"m.url\"]]\n",
    "            relation.append(rlist)\n",
    "            dic[\"mooc\"], dic[\"image\"], dic[\"url\"] = rlist[2], rlist[3], rlist[4]\n",
    "        relat.append(dic)\n",
    "        nodes += node\n",
    "        course.append([id, coursename[\"n.name\"], coursedesc[\"n.description\"]])\n",
    "    course_df = pd.DataFrame(course)\n",
    "    relation_df = pd.DataFrame(relation)\n",
    "    print(\"    ----------Study Path: School Course with Recommended MOOC----------\")\n",
    "    refernce_display(relat)\n",
    "    j = json.dumps(relat)\n",
    "    print(\"       ----------Course Enrollment Table----------\")\n",
    "    return course_df\n",
    "\n",
    "\n",
    "def topo_Sort(program_name):\n",
    "    graph = Graph(\"http://localhost:7474/db/data/\")\n",
    "    query = \"\"\"\n",
    "            MATCH (m)-[:HasPrerequisite]->(n) \n",
    "            WHERE (m)-[:UnderProgram]->({name:'\"\"\"+pname+\"\"\"'}) \n",
    "            and (n)-[:UnderProgram]->({name:'\"\"\"+pname+\"\"\"'}) \n",
    "            RETURN m.id, n.id\n",
    "            \"\"\"\n",
    "    adjPair = graph.data(query)\n",
    "\n",
    "    courselist = []\n",
    "    for i in adjPair:\n",
    "        courselist += [i[\"m.id\"], i[\"n.id\"]]\n",
    "    courselist = list(set(courselist))\n",
    "\n",
    "    g = Prerequisite(courselist)\n",
    "    for edge in adjPair:\n",
    "        g.addEdge(edge[\"m.id\"], edge[\"n.id\"])\n",
    "    # MATCH (n:Course{id:\"BUAD 280\"}) RETURN n\n",
    "    toposort = g.tps()\n",
    "    return display_list(toposort[::-1])\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "    ----------Study Path: School Course with Recommended MOOC----------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <table style=\"width:100%\" bordercolor='lightgreen'>\n",
       "          <tr>\n",
       "            <th style=\"text-align:left\"; width=\"10%;\">Code</th>\n",
       "            <th style=\"text-align:left\"; width=\"30%;\">Name</th> \n",
       "            <th style=\"text-align:left\"; width=\"20%;\">Image</th>\n",
       "            <th style=\"text-align:left\"; width=\"40%;\">MOOC</th>\n",
       "          </tr>\n",
       "          \n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 280</td>\n",
       "                <td style=\"text-align:left\";>BUAD 280 Introduction to Financial Accounting</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/f2/fdfaf0f9a511e6a5f4effa0e2c4d64/investigaci_n-de-mercados-y-comportamiento.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/foundations-management\" target=\"_blank\">Accounting: Principles of Financial Accounting</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 281</td>\n",
       "                <td style=\"text-align:left\";>BUAD 281 Introduction to Managerial Accounting</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d396qusza40orc.cloudfront.net/phoenixassets/learn-finance/BNY_Specialization_Banner_logo.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/value-chain-management\" target=\"_blank\">Managerial Accounting: Cost Behaviors, Systems, and Analysis</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 371</td>\n",
       "                <td style=\"text-align:left\";>ACCT 371 Introduction to Accounting Systems</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/dd/7ae3d0bd8411e6834f83bd22b5a2e6/PositivePsychology_MOOC_Icons_Specialization.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/business-technology-managment\" target=\"_blank\">Accounting and Finance for IT professionals</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 478</td>\n",
       "                <td style=\"text-align:left\";>ACCT 478 Accounting Systems Design</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/3e/b505c0ee7611e4890b43504b150d21/online_learning_slide_vAccounting.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/wharton-financial-accounting\" target=\"_blank\">More Introduction to Financial Accounting</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 476</td>\n",
       "                <td style=\"text-align:left\";>ACCT 476 Performance Measurement Issues</td> \n",
       "                <td><img src=https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTWVTAsQKuMSTnREno6zNLCslVti6JN7G9RHpDFXaikAiF36rquQakV1igF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"https://www.khanacademy.org/math/cc-2nd-grade-math/cc-2nd-measurement-data\" target=\"_blank\">Measurement and data </td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 302</td>\n",
       "                <td style=\"text-align:left\";>BUAD 302T Communication Strategy in Accounting</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 304</td>\n",
       "                <td style=\"text-align:left\";>BUAD 304 Organizational Behavior and Leadership</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/62/58d990f18cd48083251c3e57fe9e7e/Untitled-1.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/academic-discussion-english\" target=\"_blank\">International Leadership and Organizational Behavior</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>MATH 118</td>\n",
       "                <td style=\"text-align:left\";>MATH 118gx Fundamental Principles of Calculus</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>MATH 125</td>\n",
       "                <td style=\"text-align:left\";>MATH 125g Calculus I</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/05/cda840977511e5aa161903ab17f92e/CSV-logo-chapter-5-copy.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/discrete-calculus\" target=\"_blank\">Single Variable Calculus</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ECON 351</td>\n",
       "                <td style=\"text-align:left\";>ECON 351x Microeconomics for Business</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/06/ab77207de611e78b8cbf6b7d2487ac/image-1.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/parprog1\" target=\"_blank\">Strategic Business Management - Microeconomics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 306</td>\n",
       "                <td style=\"text-align:left\";>BUAD 306 Business Finance</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/4c/868cb0658911e6892f017139b2b060/coursera-ma-thumbnail.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/english-for-business\" target=\"_blank\">Business English: Finance and Economics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 307</td>\n",
       "                <td style=\"text-align:left\";>BUAD 307 Marketing Fundamentals</td> \n",
       "                <td><img src=https://s3-us-west-1.amazonaws.com/udacity-content/course-images/cx11-e152d95.jpg height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"https://www.udacity.com/course/digital-marketing-fundamentals--cx11\" target=\"_blank\">Digital Marketing Fundamentals</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>BUAD 497</td>\n",
       "                <td style=\"text-align:left\";>BUAD 497 Strategic Management</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/d3/d90f107de511e7b945f75a7283d500/image-2.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/trigonometry\" target=\"_blank\">Strategic Business Management - Macroeconomics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 372</td>\n",
       "                <td style=\"text-align:left\";>ACCT 372 Internal Reporting Issues</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 370</td>\n",
       "                <td style=\"text-align:left\";>ACCT 370 External Financial Reporting Issues</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 373</td>\n",
       "                <td style=\"text-align:left\";>ACCT 373 Introduction to Auditing and Assurance Services</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 374</td>\n",
       "                <td style=\"text-align:left\";>ACCT 374 Introduction to Tax Issues</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 377</td>\n",
       "                <td style=\"text-align:left\";>ACCT 377 Valuation for Financial Statement Purposes</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 430</td>\n",
       "                <td style=\"text-align:left\";>ACCT 430 Accounting Ethics</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ef/485800fcfd11e6b4cc3359e41f40e9/Pricing-Strategy.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/business-analytics\" target=\"_blank\">Accounting Analytics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 477</td>\n",
       "                <td style=\"text-align:left\";>ACCT 477 Intermediate Fair Value Issues in Accounting</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 462</td>\n",
       "                <td style=\"text-align:left\";>ACCT 462 Detecting Fraudulent Financial Reporting</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 475</td>\n",
       "                <td style=\"text-align:left\";>ACCT 475 Systems Security and Audit</td> \n",
       "                <td><img src=https://lh3.googleusercontent.com/pjV2kaEQlQuzZSTR8YwIYyDieRxdfH6i0QfGzSCI1iTawtnhYJmbn2RC0rXdsnSGf6FaoIuLHE11NyFL=s0#w=1280&h=720=s276#w=1724&h=1060 height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"https://www.udacity.com/course/cyber-physical-systems-security--ud279\" target=\"_blank\">Cyber-Physical Systems Security</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 470</td>\n",
       "                <td style=\"text-align:left\";>ACCT 470 Advanced External Financial Reporting Issues</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 474</td>\n",
       "                <td style=\"text-align:left\";>ACCT 474 Tax Issues for Business</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 416</td>\n",
       "                <td style=\"text-align:left\";>ACCT 416 Financial Reporting and Analysis</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/3e/b505c0ee7611e4890b43504b150d21/online_learning_slide_vAccounting.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/learn/wharton-financial-accounting\" target=\"_blank\">More Introduction to Financial Accounting</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 479</td>\n",
       "                <td style=\"text-align:left\";>ACCT 479 Accounting Systems Development</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ef/485800fcfd11e6b4cc3359e41f40e9/Pricing-Strategy.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/business-analytics\" target=\"_blank\">Accounting Analytics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 473</td>\n",
       "                <td style=\"text-align:left\";>ACCT 473 Financial Statement Auditing</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 471</td>\n",
       "                <td style=\"text-align:left\";>ACCT 471 Accounting Information Systems</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/e7/871c10757e11e7817cc9840feed7fa/enigma_rotors_with_alphabet_rings_cropped.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/business-analytics\" target=\"_blank\">Accounting Analytics</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 472</td>\n",
       "                <td style=\"text-align:left\";>ACCT 472 Managerial Accounting</td> \n",
       "                <td><img src=https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d396qusza40orc.cloudfront.net/phoenixassets/learn-finance/BNY_Specialization_Banner_logo.jpg?auto=format%2Ccompress&dpr=1&w=100&h=100&fit=fill&bg=FFF height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"http://www.coursera.org/specializations/value-chain-management\" target=\"_blank\">Managerial Accounting: Cost Behaviors, Systems, and Analysis</td></tr>\n",
       "            <tr>\n",
       "                <td style=\"text-align:left\";>ACCT 463</td>\n",
       "                <td style=\"text-align:left\";>ACCT 463 Internal Audit</td> \n",
       "                <td><img src= height=\"120px\"; display: inline-block;></td>\n",
       "                <td style=\"text-align:left\";> <a href=\"\" target=\"_blank\"></td></tr>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "       ----------Course Enrollment Table----------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>BUAD 280</td>\n",
       "      <td>BUAD 280 Introduction to Financial Accounting</td>\n",
       "      <td>Emphasis on understanding financial statements...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>BUAD 281</td>\n",
       "      <td>BUAD 281 Introduction to Managerial Accounting</td>\n",
       "      <td>An emphasis on how accounting information , co...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ACCT 371</td>\n",
       "      <td>ACCT 371 Introduction to Accounting Systems</td>\n",
       "      <td>Understanding of technology and controls neede...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ACCT 478</td>\n",
       "      <td>ACCT 478 Accounting Systems Design</td>\n",
       "      <td>Explores the design of accounting systems . In...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ACCT 476</td>\n",
       "      <td>ACCT 476 Performance Measurement Issues</td>\n",
       "      <td>Introduction to understanding how management c...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>BUAD 302</td>\n",
       "      <td>BUAD 302T Communication Strategy in Accounting</td>\n",
       "      <td>Theory , practices , and techniques essential ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>BUAD 304</td>\n",
       "      <td>BUAD 304 Organizational Behavior and Leadership</td>\n",
       "      <td>The role of leadership in business organizatio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>MATH 118</td>\n",
       "      <td>MATH 118gx Fundamental Principles of Calculus</td>\n",
       "      <td>Derivatives ; extrema . Definite integral ; fu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>MATH 125</td>\n",
       "      <td>MATH 125g Calculus I</td>\n",
       "      <td>Limits ; continuity , derivatives and applicat...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ECON 351</td>\n",
       "      <td>ECON 351x Microeconomics for Business</td>\n",
       "      <td>Development and business applications of : the...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>BUAD 306</td>\n",
       "      <td>BUAD 306 Business Finance</td>\n",
       "      <td>Financial problems of business enterprise ; fu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>BUAD 307</td>\n",
       "      <td>BUAD 307 Marketing Fundamentals</td>\n",
       "      <td>Develops a managerial viewpoint in planning an...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>BUAD 497</td>\n",
       "      <td>BUAD 497 Strategic Management</td>\n",
       "      <td>Examination of managerial decision-making , pl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ACCT 372</td>\n",
       "      <td>ACCT 372 Internal Reporting Issues</td>\n",
       "      <td>Understanding of decision-making , problem sol...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ACCT 370</td>\n",
       "      <td>ACCT 370 External Financial Reporting Issues</td>\n",
       "      <td>Understanding of decision-making , problem sol...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>ACCT 373</td>\n",
       "      <td>ACCT 373 Introduction to Auditing and Assuranc...</td>\n",
       "      <td>Exploration of the requisite skills and knowle...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ACCT 374</td>\n",
       "      <td>ACCT 374 Introduction to Tax Issues</td>\n",
       "      <td>Basic tax principles , introduction to U .S . ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>ACCT 377</td>\n",
       "      <td>ACCT 377 Valuation for Financial Statement Pur...</td>\n",
       "      <td>Explores Accounting Standards Codification (AS...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>ACCT 430</td>\n",
       "      <td>ACCT 430 Accounting Ethics</td>\n",
       "      <td>Theoretical knowledge and practical applicatio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>ACCT 477</td>\n",
       "      <td>ACCT 477 Intermediate Fair Value Issues in Acc...</td>\n",
       "      <td>Develops the ability to identify and understan...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>ACCT 462</td>\n",
       "      <td>ACCT 462 Detecting Fraudulent Financial Reporting</td>\n",
       "      <td>Understanding/identifying methods of fraudulen...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ACCT 475</td>\n",
       "      <td>ACCT 475 Systems Security and Audit</td>\n",
       "      <td>Issues related to the security , control , and...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>ACCT 470</td>\n",
       "      <td>ACCT 470 Advanced External Financial Reporting...</td>\n",
       "      <td>Develop capabilities to identify and resolve a...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>ACCT 474</td>\n",
       "      <td>ACCT 474 Tax Issues for Business</td>\n",
       "      <td>Capabilities to identify and articulate tax is...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>ACCT 416</td>\n",
       "      <td>ACCT 416 Financial Reporting and Analysis</td>\n",
       "      <td>Examination of the role of financial statement...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>ACCT 479</td>\n",
       "      <td>ACCT 479 Accounting Systems Development</td>\n",
       "      <td>Examines the fundamentals of accounting system...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>ACCT 473</td>\n",
       "      <td>ACCT 473 Financial Statement Auditing</td>\n",
       "      <td>Course builds on the background developed in A...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>ACCT 471</td>\n",
       "      <td>ACCT 471 Accounting Information Systems</td>\n",
       "      <td>Issues related to the design , control , and i...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>ACCT 472</td>\n",
       "      <td>ACCT 472 Managerial Accounting</td>\n",
       "      <td>Understanding of systems providing cost inform...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>ACCT 463</td>\n",
       "      <td>ACCT 463 Internal Audit</td>\n",
       "      <td>Examination of internal audit/auditors and the...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           0                                                  1  \\\n",
       "0   BUAD 280      BUAD 280 Introduction to Financial Accounting   \n",
       "1   BUAD 281     BUAD 281 Introduction to Managerial Accounting   \n",
       "2   ACCT 371        ACCT 371 Introduction to Accounting Systems   \n",
       "3   ACCT 478                 ACCT 478 Accounting Systems Design   \n",
       "4   ACCT 476            ACCT 476 Performance Measurement Issues   \n",
       "5   BUAD 302     BUAD 302T Communication Strategy in Accounting   \n",
       "6   BUAD 304    BUAD 304 Organizational Behavior and Leadership   \n",
       "7   MATH 118      MATH 118gx Fundamental Principles of Calculus   \n",
       "8   MATH 125                               MATH 125g Calculus I   \n",
       "9   ECON 351              ECON 351x Microeconomics for Business   \n",
       "10  BUAD 306                          BUAD 306 Business Finance   \n",
       "11  BUAD 307                    BUAD 307 Marketing Fundamentals   \n",
       "12  BUAD 497                      BUAD 497 Strategic Management   \n",
       "13  ACCT 372                 ACCT 372 Internal Reporting Issues   \n",
       "14  ACCT 370       ACCT 370 External Financial Reporting Issues   \n",
       "15  ACCT 373  ACCT 373 Introduction to Auditing and Assuranc...   \n",
       "16  ACCT 374                ACCT 374 Introduction to Tax Issues   \n",
       "17  ACCT 377  ACCT 377 Valuation for Financial Statement Pur...   \n",
       "18  ACCT 430                         ACCT 430 Accounting Ethics   \n",
       "19  ACCT 477  ACCT 477 Intermediate Fair Value Issues in Acc...   \n",
       "20  ACCT 462  ACCT 462 Detecting Fraudulent Financial Reporting   \n",
       "21  ACCT 475                ACCT 475 Systems Security and Audit   \n",
       "22  ACCT 470  ACCT 470 Advanced External Financial Reporting...   \n",
       "23  ACCT 474                   ACCT 474 Tax Issues for Business   \n",
       "24  ACCT 416          ACCT 416 Financial Reporting and Analysis   \n",
       "25  ACCT 479            ACCT 479 Accounting Systems Development   \n",
       "26  ACCT 473              ACCT 473 Financial Statement Auditing   \n",
       "27  ACCT 471            ACCT 471 Accounting Information Systems   \n",
       "28  ACCT 472                     ACCT 472 Managerial Accounting   \n",
       "29  ACCT 463                            ACCT 463 Internal Audit   \n",
       "\n",
       "                                                    2  \n",
       "0   Emphasis on understanding financial statements...  \n",
       "1   An emphasis on how accounting information , co...  \n",
       "2   Understanding of technology and controls neede...  \n",
       "3   Explores the design of accounting systems . In...  \n",
       "4   Introduction to understanding how management c...  \n",
       "5   Theory , practices , and techniques essential ...  \n",
       "6   The role of leadership in business organizatio...  \n",
       "7   Derivatives ; extrema . Definite integral ; fu...  \n",
       "8   Limits ; continuity , derivatives and applicat...  \n",
       "9   Development and business applications of : the...  \n",
       "10  Financial problems of business enterprise ; fu...  \n",
       "11  Develops a managerial viewpoint in planning an...  \n",
       "12  Examination of managerial decision-making , pl...  \n",
       "13  Understanding of decision-making , problem sol...  \n",
       "14  Understanding of decision-making , problem sol...  \n",
       "15  Exploration of the requisite skills and knowle...  \n",
       "16  Basic tax principles , introduction to U .S . ...  \n",
       "17  Explores Accounting Standards Codification (AS...  \n",
       "18  Theoretical knowledge and practical applicatio...  \n",
       "19  Develops the ability to identify and understan...  \n",
       "20  Understanding/identifying methods of fraudulen...  \n",
       "21  Issues related to the security , control , and...  \n",
       "22  Develop capabilities to identify and resolve a...  \n",
       "23  Capabilities to identify and articulate tax is...  \n",
       "24  Examination of the role of financial statement...  \n",
       "25  Examines the fundamentals of accounting system...  \n",
       "26  Course builds on the background developed in A...  \n",
       "27  Issues related to the design , control , and i...  \n",
       "28  Understanding of systems providing cost inform...  \n",
       "29  Examination of internal audit/auditors and the...  "
      ]
     },
     "execution_count": 66,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "topo_Sort(\"Accounting (BS)\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "celltoolbar": "Raw Cell Format",
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.2"
  },
  "widgets": {
   "state": {
    "160cbd217198488897eb01511ea83bf8": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    },
    "2ea6198aa6c3436db4b70c09c95aec92": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    },
    "398b91375e91490681c946fde026eb32": {
     "views": [
      {
       "cell_index": 1
      }
     ]
    },
    "744f42bb4bd04a2c8f44136a20fa1813": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    },
    "759ac9c4e78e458887692fee5b133f1b": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    },
    "89fc4a599ea4442a8b2c2076ef94b01f": {
     "views": [
      {
       "cell_index": 1
      }
     ]
    },
    "8e42d827d7d541798f52654e73578eca": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    },
    "9dedf2c79cd045838b9a116ba97008ec": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    },
    "af56712c55194be99ee8cef2d6442f0d": {
     "views": [
      {
       "cell_index": 3
      },
      {
       "cell_index": 2
      }
     ]
    },
    "b6120b326f40488fafcec0d12cf26b37": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    },
    "cec6ae8e52d7428b9981288075006a02": {
     "views": [
      {
       "cell_index": 1
      }
     ]
    },
    "d51886ffc10846fdb84c0662acf603b1": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    },
    "db2cef930f1d43adbc3d4453141824e4": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    },
    "e299c8bd597e4b36896250b7d8c1eca1": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    },
    "f60a31ef698346b99e6774ee8e9ade82": {
     "views": [
      {
       "cell_index": 0
      }
     ]
    }
   },
   "version": "1.2.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
